GhassenHafsiaINSAT/stm32-baremetal-labs/Drivers/UART_driver/Inc/gpio.h
/*
 * gpio.h
 *
 *  Created on: Feb 15, 2025
 *      Author: ghassen
 */

#ifndef INC_GPIO_H_
#define INC_GPIO_H_

#include "stm32_Nucleo_F401RE_map.h"
#include "uart.h"
#include "gpio.h"

typedef struct {
	uint32_t GPIO_PIN;
	uint32_t GPIO_Mode;
    uint32_t GPIO_Otyper;
    uint32_t GPIO_Ospeeder;
	uint32_t GPIO_PullPush;
} GPIO_Struct;


#define GPIO_Mode_INPUT 		0x00000000
#define GPIO_Mode_OUTPUT 		0x00000001
#define GPIO_Mode_AF_PP 		0x00000002
#define GPIO_Mode_ANALOG 		0x00000003

#define OUTPUT_PUSH_PULL 		0x00000000
#define OUTPUT_OPEN_DRAIN 		0x00000001

#define LOW_SPEED 				0x00000000
#define MEDIUM_SPEED 			0x00000001
#define HIGH_SPEED 				0x00000002
#define VERY_HIGH_MODE 			0x00000003

#define GPIO_PullPush_NoPull 	0x00000000
#define PULL_UP 				0x00000001
#define PULL_DOWN 				0x00000002


#define GPIO_PIN_0 	((uint16_t)0x0001)
#define GPIO_PIN_1 	((uint16_t)0x0002)
#define GPIO_PIN_2 	((uint16_t)0x0004)
#define GPIO_PIN_3 	((uint16_t)0x0008)
#define GPIO_PIN_4 	((uint16_t)0x0010)
#define GPIO_PIN_5 	((uint16_t)0x0020)
#define GPIO_PIN_6 	((uint16_t)0x0040)
#define GPIO_PIN_7 	((uint16_t)0x0080)
#define GPIO_PIN_8 	((uint16_t)0x0100)
#define GPIO_PIN_9	((uint16_t)0x0200)
#define GPIO_PIN_10 ((uint16_t)0x0400)
#define GPIO_PIN_11 ((uint16_t)0x0800)
#define GPIO_PIN_12	((uint16_t)0x1000)
#define GPIO_PIN_13	((uint16_t)0x2000)
#define GPIO_PIN_14	((uint16_t)0x4000)
#define GPIO_PIN_15	((uint16_t)0x8000)

void GPIO_Init(GPIO_Typedef* GPIOx, USART_config* usart);
void GPIO_SetAF(GPIO_TypeDef *GPIOx, uint8_t pin, uint8_t AF);

#endif /* INC_GPIO_H_ */

